Управление_по_целям_и_KPI/src/Catalogs/KPI_ГрафикиРабот/KPI_ГрафикиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_ГрафикиРабот</name>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>Number</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочихЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаГрафика</name>
    <type>
      <types>CatalogRef.KPI_ФормулыГрафиков</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеГрафика</name>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов7</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов8</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов9</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов12</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов13</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов14</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов15</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов16</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов17</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов19</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов20</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов21</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов22</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов23</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов24</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов25</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов26</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов27</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов28</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов29</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов30</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов31</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня1</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня2</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня3</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня4</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня5</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня6</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня7</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня8</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня9</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня10</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня11</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня12</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня13</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня14</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня15</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня16</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня17</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня18</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня19</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня20</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня21</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня22</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня23</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня24</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня25</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня26</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня27</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня28</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня29</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня30</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня31</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_ГрафикиРабот/KPI_ГрафикиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_ГрафикиРабот</name>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.KPI_ВидыДнейГрафика</types>
    </type>
  </resources>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.KPI_ГрафикиРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/Catalogs/KPI_ГрафикиРабот/ManagerModule.bsl
//Функция получает виды дней графика
//Параметры:
// ГрафикРаботы - тип СправочникСсылка.KPI_ГрафикиРаботы
//Возвращаемое значение:
// Выборка видов дней - тип ВыбораИзРезультатаЗапроса
Функция ВидыДнейГрафика(ГрафикРаботы) Экспорт
	
	Год = ГрафикРаботы.Год;
	Если НЕ ЗначениеЗаполнено(Год) Тогда 	
		Год = Год(ТекущаяДата());
	КонецЕсли;
	
	НачалоПериода = Дата(Формат(Год,"ЧГ=" )+ "0101");
	КонецПериода  = Дата(Формат(Год,"ЧГ=") + "1231");

	
	ТекстЗапроса =  "ВЫБРАТЬ
	|	ПраздничныеДни.Дата,
	|	НАЧАЛОПЕРИОДА(ПраздничныеДни.Дата, МЕСЯЦ) КАК НачалоМесяца,
	|	ПраздничныеДни.ВидДня
	|ИЗ
	|	РегистрСведений.KPI_ГрафикиРабот КАК ПраздничныеДни
	|ГДЕ
	|	ПраздничныеДни.ГрафикРаботы = &ГрафикРаботы
	|	И ПраздничныеДни.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПраздничныеДни.Дата
	|ИТОГИ ПО
	|	НачалоМесяца";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("НачалоПериода"  ,НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода"   ,КонецПериода);
	Запрос.УстановитьПараметр("ГрафикРаботы"   ,ГрафикРаботы); 
	
	ВыборкаМесяцев = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат ВыборкаМесяцев;
	
	
КонецФункции

//Функция праздничные дни года
//Параметры:
// Год - тип Число
//Возвращаемое значение:
// Выборка видов дней - тип ВыбораИзРезультатаЗапроса
Функция ПраздничныеДни(Год) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПраздничныеДни.Дата,
	|	ПраздничныеДни.ВидДня
	|ИЗ
	|	РегистрСведений.KPI_ГрафикиРабот КАК ПраздничныеДни
	|ГДЕ
	|	ПраздничныеДни.ГрафикРаботы = ЗНАЧЕНИЕ(Справочник.KPI_ГрафикиРабот.ПустаяСсылка)
	|	И ПраздничныеДни.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПраздничныеДни.Дата";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Если НЕ ЗначениеЗаполнено(Год) Тогда 	
		Год = Год(ТекущаяДата());
	КонецЕсли;
	НачалоПериода = Дата(Формат(Год,"ЧГ=" )+ "0101");
	КонецПериода  = Дата(Формат(Год,"ЧГ=") + "1231");
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода" ,КонецПериода);
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции
